# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [5,6, 8,14, 15,11]  # P2/4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
# anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64,3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [[2, 3, C3, [128, False]],  # 10
   [-1, 3, C3, [128, False]], # 11
   [-1, 3, C3, [128, False]], # 12 p2
   [-3, 1, Conv, [128, 3, 2]],  #13
   [-3, 1, Conv, [128, 3, 2]],  #14
   [-4, 1, Conv, [128, 3, 2]],  #15
   [-4, 1, Conv, [128, 3, 2]],  #16

   [[4, 13, 14], 1, Concat, [1]], # 17
   [-1, 3, C3, [256, False]], # 18
   [[-1, 15, 16], 1, Concat, [1]], # 19
   [-1, 3, C3, [256, False]], # 20 p3
   [-3, 1, Conv, [256, 3, 2]],  #21
   [-2, 1, Conv, [256, 3, 2]],  #22

   [[6, 21, 22], 1, Concat, [1]], # 23
   [-1, 3, C3, [512, False]], # 24 p4
   [-1, 1, Conv, [512, 3, 2]],  #25

   [8, 1, Conv, [512, 1, 1]], # 26
   [[-1, 25], 1, Concat, [1]], # 27
   [-1, 3, C3, [1024, False]], # 28 p5

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 29
   [-1, 1, Conv, [512, 1, 1]], # 30
   [[24, -1], 1, Concat, [1]],  # 31
   [-1, 3, C3, [512, False]], # 32 p4

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 33
   [-1, 1, Conv, [256, 1, 1]], # 34
   [[20, -1], 1, Concat,[1]],  # 35
   [-1, 3, C3, [ 256, False]], # 36 p3

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 37
   [-1, 1, Conv, [128, 1, 1]], # 38
   [[12, -1], 1, Concat,[1]],  # 39
   [-1, 3, C3, [128, False]], # 40 p2

   [[40, 36, 32, 28], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
