# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [5,6, 8,14, 15,11]  # P2/4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
# anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64,3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat, [1]],  # 12-cat backbone P4
   [ -1, 1, Conv, [ 512, 1, 1 ] ],
   [ -2, 1, Conv, [ 512, 1, 1 ] ],
   [ -1, 1, Conv, [ 256, 3, 1 ] ],
   [ -1, 1, Conv, [ 256, 3, 1 ] ],
   [ -1, 1, Conv, [ 256, 3, 1 ] ],
   [ -1, 1, Conv, [ 256, 3, 1 ] ],
   [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 512, 1,1 ] ], # 20-[-1, 3, C3, [512, False]],

   [-1, 1, Conv, [256, 1, 1]],  # 21
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # 23-cat backbone P3
   [ -1, 1, Conv, [ 256, 1, 1 ] ],
   [ -2, 1, Conv, [ 256, 1, 1 ] ],
   [ -1, 1, Conv, [ 128, 3, 1 ] ],
   [ -1, 1, Conv, [ 128, 3, 1 ] ],
   [ -1, 1, Conv, [ 128, 3, 1 ] ],
   [ -1, 1, Conv, [ 128, 3, 1 ] ],
   [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 256, 1,1 ] ],  # 31-[-1, 3, C3, [256, False]],

   [-1, 1, Conv, [128, 1, 1]],  # 32
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # 34-cat backbone P2
   [ -1, 1, Conv, [ 128, 1, 1 ] ],
   [ -2, 1, Conv, [ 128, 1, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 128, 1,1 ] ],   # 42-[-1, 3, C3, [128]],  # 21 (P2/4-xsmall)

   [-1, 1, Conv, [128, 3, 2]],  # 43
   [[-1, 32], 1, Concat, [1]],  # cat head P3
   [-1, 3, C3, [256]],  # 45-(P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],  # 46
   [[-1, 21], 1, Concat, [1]],  # 47-cat head P4
   [-1, 3, C3, [512]],  # 48-(P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]], # 49
   [[-1, 10], 1, Concat, [1]],  # 50-cat head P5
   [-1, 3, C3, [1024]],  # 51-(P5/32-large)

   [[42, 45, 48, 51], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
