# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [5,6, 8,14, 15,11]  # P2/4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
# anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64,3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [[-1, 1, Conv, [512, 1, 1]], # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 6], 1, Concat, [1]],  # 12 cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]], #14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #15
   [[-1, 4], 1, Concat, [1]],  #  16 cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]], #18
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #19
   [[-1, 2], 1, Concat, [1]],  #  20 cat backbone P2
   [-1, 3, C3, [128, False]],  # 21 (P2/4-xsmall)

   [17, 1, Conv, [128, 1, 1]], # 22
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 23
   [[21, -1], 1, Concat, [1]],  # 24 cat head P3
   [-1, 3, C3, [128, False]],  # 25 (P3/8-small)

   [ 13, 1, Conv, [ 256, 1, 1 ] ], # 26
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ], # 27
   [ [ 17, -1 ], 1, Concat, [ 1 ] ],  # 28 cat head P3
   [ -1, 3, C3, [ 256, False ] ],  # 29 (P3/8-small)

   [ 29, 1, Conv, [ 128, 1, 1 ] ], # 30
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ], # 31
   [ [ 25, -1 ], 1, Concat, [ 1 ] ],  # 32 cat head P3
   [ -1, 3, C3, [ 128, False ] ],  # 33 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]], # 34
   [ 29, 1, Conv, [ 128, 1, 1 ] ], # 35
   [[-2, -1], 1, Concat, [1]],  # 36 cat head P4
   [-1, 3, C3, [256, False]],  # 37 (P4/16-medium)

   [-1, 1, Conv, [256, 3, 2]], # 38
   [ 13, 1, Conv, [ 256, 1, 1 ] ], # 39
   [[-2, -1], 1, Concat, [1]],  # 40 cat head P5
   [-1, 3, C3, [512, False]],  # 41(P5/32-large)

   [ -1, 1, Conv, [ 512, 3, 2 ] ], # 42
   [ [ -1,10 ], 1, Concat, [ 1 ] ],  # 43 cat head P5
   [ -1, 3, C3, [ 1024, False ] ],  # 44 (P5/32-large)

   [[33, 37, 41, 44], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
